{
  "backend/main.mo": "Motoko canister implementing user profiles, lessons, permission checks, and credit-based lesson completion with mixin authorization and blob storage.",
  "feature_evidence.json": "Feature evidence record describing a frontend update raising video upload limits to 100MB and listing related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for all major frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for light and dark themes and applying global background/text styles.",
  "frontend/index.html": "HTML entry point containing the root div and script loader for the Vite React app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, authentication gating, and layout with header and bottom navigation.",
  "frontend/src/components/auth/AuthButton.tsx": "Logout button component using Internet Identity and clearing React Query cache on sign-out.",
  "frontend/src/components/brand/BrandLogo.tsx": "Brand logo renderer supporting icon, wordmark, or combined variants with size options.",
  "frontend/src/components/credits/CreditBalanceBadge.tsx": "Badge showing the user’s remaining learning credits using a query hook.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky header with navigation logo, credit badge, and logout button.",
  "frontend/src/components/layout/AppShell.tsx": "Simple container layout wrapper providing consistent spacing.",
  "frontend/src/components/layout/BottomNav.tsx": "Fixed mobile-first bottom navigation bar for Lessons, Upload, and Profile routes.",
  "frontend/src/components/lessons/LessonCard.tsx": "Clickable lesson preview card showing title, description, creator, date, and credit cost.",
  "frontend/src/components/lessons/VideoPlayer.tsx": "Video player converting byte arrays to a blob URL and showing a loading spinner while preparing the video.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal component that collects a user's display name and optional Gmail, then saves the profile with initial credits.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller's user profile using the current actor, managing loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, stored identity handling, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for lessons and profile operations including fetch, create, complete, and save profile.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and base styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AuthPage.tsx": "Login page that prompts users to sign in with Internet Identity and introduces app features.",
  "frontend/src/pages/LessonDetailPage.tsx": "Displays a lesson with video, metadata, and completion flow including credit checks.",
  "frontend/src/pages/LessonsPage.tsx": "Lists all lessons with loading, error, and empty states using LessonCard components.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the user profile page with fields for viewing and editing name and optional Gmail, using hooks to load and save profile data.",
  "frontend/src/pages/UploadLessonPage.tsx": "Provides a form to create and upload a video lesson with title, description, credit cost, and validated video file handling.",
  "frontend/src/utils/bigintFormat.ts": "Utility functions for formatting bigint values as dates, date-times, and credit strings.",
  "frontend/src/utils/fileToUint8Array.ts": "Converts uploaded files to Uint8Array with size checks and validates video files against type and 100MB limit.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout utilities with plugins for typography and container queries.",
  "project_state.json": "Metadata describing project requirements, implemented features, and architectural notes for the SkillSwap app."
}